Catalogs/ЛБ_ШаблоныПриказовАкцииПроцентныеСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_ШаблоныПриказовАкцииПроцентныеСтавки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДопИнформацияПроцентныеСтавки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтавкиПроцентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаПрименения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗалогодателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СтатусыЗалогодателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДиапазонСумм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДиапазоныСуммЗайма</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ЛБ_ПричиныПримененияПроцентнойСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ПричиныПримененияПроцентнойСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛБ_СхемыКредитования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_СхемыКредитования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезПродленияДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПримененияГибкогоПроцента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПрименятьАкции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказОтВыкупа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПричиныПримененияПроцентнойСхемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаПрименения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗалоговогоБилета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛБ_ШаблоныПриказовАкцииПроцентныеСтавки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Объект.Дата = ТекущаяДата();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ИнформацияПроцентныеСтавки = ТекущийОбъект.ДопИнформацияПроцентныеСтавки.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДопИнформацияПроцентныеСтавки = Новый ХранилищеЗначения(ИнформацияПроцентныеСтавки);	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСтавок(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Объект.СтавкиПроцентов.Очистить();
	Если Результат.СхемыКредитования.Количество() = 0 Тогда
		Для каждого Стр1 Из Результат.СтатусыКлиентов Цикл 
			Для каждого Стр2 Из Результат.ДиапазоныСумм Цикл
			    НоваяСтр = Объект.СтавкиПроцентов.Добавить(); 
				НоваяСтр.СхемаКредитования = Справочники.ЛБ_СхемыКредитования.ПустаяСсылка(); 
				НоваяСтр.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
				НоваяСтр.СтатусЗалогодателя = Стр1.Статус;
	            НоваяСтр.ДиапазонСумм = Стр2.ДиапазонСумм;				
			КонецЦикла;
		КонецЦикла;	
	Иначе	   
		Для каждого Стр0 Из Результат.СхемыКредитования Цикл
			Для каждого Стр1 Из Стр0.СхемаКредитования.ПричиныПримененияПроцентнойСхемы Цикл
				Для каждого Стр2 Из Результат.СтатусыКлиентов Цикл
					Для каждого Стр3 Из Результат.ДиапазоныСумм Цикл
					    НоваяСтр = Объект.СтавкиПроцентов.Добавить();
						НоваяСтр.СхемаКредитования = Стр0.СхемаКредитования;
						НоваяСтр.ПричинаПрименения = Стр1.ПричинаПрименения;
						НоваяСтр.СтатусЗалогодателя = Стр2.Статус;
			            НоваяСтр.ДиапазонСумм = Стр3.ДиапазонСумм;				
					КонецЦикла; 
				КонецЦикла;	
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеПроцентныхСтавок(Команда) 
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораСтавок",ЭтаФорма);  
	ОткрытьФорму("Обработка.ЛБ_ПомощникЗаполненияПроцентныхСтавокАкции.Форма", , ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСтавокДобавить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;     
	
	Если Результат.СхемыКредитования.Количество() = 0 Тогда
		Для каждого Стр1 Из Результат.СтатусыКлиентов Цикл 
			Для каждого Стр2 Из Результат.ДиапазоныСумм Цикл
				Отбор = Новый Структура;   
				Отбор.Вставить("СхемаКредитования", Справочники.ЛБ_СхемыКредитования.ПустаяСсылка());
				Отбор.Вставить("ПричинаПрименения", Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма); 
				Отбор.Вставить("СтатусЗалогодателя", Стр1.Статус);
				Отбор.Вставить("ДиапазонСумм", Стр2.ДиапазонСумм);
				
				Строки = Объект.СтавкиПроцентов.НайтиСтроки(Отбор);
				Если Строки.Количество() = 0 Тогда
				    НоваяСтр = Объект.СтавкиПроцентов.Добавить(); 
					НоваяСтр.СхемаКредитования = Справочники.ЛБ_СхемыКредитования.ПустаяСсылка(); 
					НоваяСтр.ПричинаПрименения = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
					НоваяСтр.СтатусЗалогодателя = Стр1.Статус;
		            НоваяСтр.ДиапазонСумм = Стр2.ДиапазонСумм;	
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;	
	Иначе	   
		Для каждого Стр0 Из Результат.СхемыКредитования Цикл
			Для каждого Стр1 Из Стр0.СхемаКредитования.ПричиныПримененияПроцентнойСхемы Цикл
				Для каждого Стр2 Из Результат.СтатусыКлиентов Цикл
					Для каждого Стр3 Из Результат.ДиапазоныСумм Цикл 
						Отбор = Новый Структура;   
						Отбор.Вставить("СхемаКредитования", Стр0.СхемаКредитования);
						Отбор.Вставить("ПричинаПрименения", Стр1.ПричинаПрименения); 
						Отбор.Вставить("СтатусЗалогодателя", Стр2.Статус);
						Отбор.Вставить("ДиапазонСумм", Стр3.ДиапазонСумм);
						
						Строки = Объект.СтавкиПроцентов.НайтиСтроки(Отбор);
						Если Строки.Количество() = 0 Тогда
						    НоваяСтр = Объект.СтавкиПроцентов.Добавить();
							НоваяСтр.СхемаКредитования = Стр0.СхемаКредитования;
							НоваяСтр.ПричинаПрименения = Стр1.ПричинаПрименения;
							НоваяСтр.СтатусЗалогодателя = Стр2.Статус;
				            НоваяСтр.ДиапазонСумм = Стр3.ДиапазонСумм;
						КонецЕсли;	
					КонецЦикла; 
				КонецЦикла;	
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;	
  КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеПроцентныхСтавок(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораСтавокДобавить",ЭтаФорма); 
	ОткрытьФорму("Обработка.ЛБ_ПомощникЗаполненияПроцентныхСтавокАкции.Форма", , ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораПричиныПримененияОчистить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ПричинаПрименения", Результат);
	СтрокиМ = Объект.СтавкиПроцентов.НайтиСтроки(Отбор);
	
	Для каждого СтрМ из СтрокиМ Цикл
		Объект.СтавкиПроцентов.Удалить(СтрМ);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоПричинеПрименения(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПричиныПримененияОчистить",ЭтаФорма);
    ОткрытьФорму("Перечисление.ЛБ_ПричиныПримененияПроцентнойСхемы.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСтатусаКлиентаОчистить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("СтатусЗалогодателя", Результат);
	СтрокиМ = Объект.СтавкиПроцентов.НайтиСтроки(Отбор);
	
	Для каждого СтрМ из СтрокиМ Цикл
		Объект.СтавкиПроцентов.Удалить(СтрМ);
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоСтатусуКлиента(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСтатусаКлиентаОчистить",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_СтатусыЗалогодателей.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтавокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	//Если НоваяСтрока Тогда 
	//	ТекСтрока = Элементы.ТаблицаСтавок.ТекущиеДанные; 
	//	ТекСтрока.СхемаРасчетаПроцентов = ПредопределенноеЗначение("Перечисление.ЛБ_СхемыРасчетаПроцентов.Фиксированная");
	//КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСхемыКредитованияОчистить(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("СхемаКредитования", Результат);
	СтрокиМ = Объект.СтавкиПроцентов.НайтиСтроки(Отбор);
	
	Для каждого СтрМ из СтрокиМ Цикл
		Объект.СтавкиПроцентов.Удалить(СтрМ);
	Конеццикла;	
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьПоСхемеКредитования(Команда)
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСхемыКредитованияОчистить",ЭтаФорма);
    ОткрытьФорму("Справочник.ЛБ_СхемыКредитования.ФормаВыбора",,ЭтаФорма,,,,ОбработкаВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
